app/Controllers/Admin.php

    public function __construct()
    {
        $session = session();

        if (!$session->get('isLoggedIn') || $session->get('is_admin') != 1) {
            redirect()->to('/auth/login')->send();
            exit;
        }

        // Check if admin is archived
        $userModel = new UserModel();
        $user = $userModel->find($session->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '0'

    public function dashboard()
    {
        $session = session();
        $db = \Config\Database::connect();
        $userModel = new UserModel();
        $orderModel = new \App\Models\OrderModel();

        // Get total users
        $total_users = $userModel->countAll();
        $admin_count = $userModel->where('is_admin', 1)->countAllResults();
        $regular_count = $userModel->where('is_admin', 0)->countAllResults();

        // Get order statistics
        $total_orders = $orderModel->countAll();
        $pending_orders = $orderModel->where('status', 'Pending')->countAllResults();
        $completed_orders = $orderModel->whereIn('status', ['Validated', 'Completed'])->countAllResults();

        // Calculate total sales
        $total_sales = $db->table('orders')
            ->selectSum('total_amount')
            ->whereIn('status', ['Validated', 'Completed'])
            ->get()
            ->getRow()
            ->total_amount ?? 0;

        // Get order data for chart (last 7 days)
        $order_data = $db->table('orders')
            ->select('DATE(created_at) as date, COUNT(*) as count')
            ->where('created_at >=', date('Y-m-d', strtotime('-7 days')))
            ->groupBy('date')
            ->orderBy('date', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` IN ('Validated','Completed')
SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` IN ('Validated','Completed')
SELECT DATE(created_at) as date, COUNT(*) as count
FROM `orders`
WHERE `created_at` >= '2025-05-21'
GROUP BY `date`
ORDER BY `date` ASC

        $order_counts = array_column($order_data, 'count');

        // Get sales data for chart (last 7 days)
        $sales_data = $db->table('orders')
            ->select('DATE(created_at) as date, SUM(total_amount) as amount')
            ->where('created_at >=', date('Y-m-d', strtotime('-7 days')))
            ->whereIn('status', ['Validated', 'Completed'])
            ->groupBy('date')
            ->orderBy('date', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT DATE(created_at) as date, SUM(total_amount) as amount
FROM `orders`
WHERE `created_at` >= '2025-05-21'
AND `status` IN ('Validated','Completed')
GROUP BY `date`
ORDER BY `date` ASC

    public function users()
    {
        $session = session();
        $userModel = new UserModel();

        $search = $this->request->getGet('search');
        $page = $this->request->getGet('page') ?? 1;
        $perPage = 10;

        // Build the query
        $query = $userModel->where('is_archived', 0); // Only show non-archived users

        if ($search) {
            $query = $query->groupStart()
                          ->like('username', $search)
                               ->orLike('email', $search)
                          ->groupEnd();
        }

        // Get total count for pagination
        $total = $query->countAllResults(false);

        // Get paginated results
        $users = $query->limit($perPage, ($page - 1) * $perPage)
                      ->find();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_archived` = 0
SELECT *
FROM `users`
WHERE `is_archived` = 0
 LIMIT 10