app/Controllers/Home.php

SELECT *
FROM `products`
WHERE `status` = 'in_stock'
ORDER BY `category` ASC, `product_name` ASC
---
    public function mainDashboard(): string
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->where('status', 'in_stock')
                                       ->orderBy('category', 'ASC')
                                       ->orderBy('product_name', 'ASC')
                                       ->findAll();