app/Controllers/Menu.php

    public function index()
    {
        $data['products'] = $this->productModel->where('status', 'in_stock')
                                              ->orderBy('category', 'ASC')
                                              ->orderBy('product_name', 'ASC')
                                              ->findAll();
---
SELECT *
FROM `products`
WHERE `status` = 'in_stock'
ORDER BY `category` ASC, `product_name` ASC